[
    {
        "id": "1",
        "titulo": "Shrek2",
        "poster": "imagenes/shrek2.jpg",
        "director": "Andrew Adamson, Kelly Asbury y Conrad Vernon",
        "duracion": "93 min.",
        "precio": 4.99,
        "categoria": "Animacion",
        "anio": 2004,
        "sinopsis": "Cuando Shrek y la princesa Fiona regresan de su luna de miel, los padres de ella los invitan a visitar el reino de Muy Muy Lejano para celebrar la boda. Para Shrek, al que nunca abandona su fiel amigo Asno, esto constituye un gran problema. Los padres de Fiona, por su parte, no esperaban que su yerno tuviera un aspecto semejante y, mucho menos, que su hija hubiera cambiado tanto. Todo esto trastoca los planes del rey respecto al futuro del reino. Pero entonces entran en escena la maquiavelica Hada Madrina, su arrogante hijo el Principe Encantador y un minino muy especial: el Gato con Botas, experto cazador de ogros.",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "2",
        "titulo": "Joker",
        "poster": "imagenes/joker.jpg",
        "director": "Todd Phillips",
        "duracion": "121 min.",
        "precio": 18.99,
        "categoria": "Drama",
        "anio": 2019,
        "sinopsis": "Arthur Fleck (Phoenix) vive en Gotham con su madre, y su unica motivacion en la vida es hacer reir a la gente. Actua haciendo de payaso en algunos trabajos, pero tiene problemas mentales que hacen que la gente le vea como un bicho raro. Su gran deseo es actuar como comico delante del publico, pero una serie de tragicos acontecimientos le hara ir incrementando su ira contra una sociedad que le ignora. ",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "3",
        "titulo": "El castillo ambulante",
        "poster": "imagenes/castillo.jpg",
        "director": "Hayao Miyazaki",
        "duracion": "119 min.",
        "precio": 4.99,
        "categoria": "Animacion",
        "anio": 2004,
        "sinopsis": "Narra la historia de Sophie, una joven sobre la que pesa una horrible maldicion que le confiere el aspecto de una anciana. Sophie decide pedir ayuda al mago Howl, que vive en un castillo ambulante, pero tal vez sea Howl quien necesite la ayuda de Sophie. ",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "4",
        "titulo": "El jardin de las palabras",
        "poster": "imagenes/jardin.jpg",
        "director": "Makoto Shinkai",
        "duracion": "46 min.",
        "precio": 2.99,
        "categoria": "Animacion",
        "anio": 2013,
        "sinopsis": "La historia tiene lugar en la temporada de lluvia de Japon durante el mes de junio. Un aprendiz de zapatero llamado Takao se encuentra dibujando zapatos en un jardin japones cuando conoce a una misteriosa mujer mayor que el. Desde ese primer encuentro, ambos siguen reuniendose y estrechando su relacion.",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "5",
        "titulo": "Your Name",
        "poster": "imagenes/your_name.jpg",
        "director": "Makoto Shinkai",
        "duracion": "106 min.",
        "precio": 4.99,
        "categoria": "Animacion",
        "anio": 2016,
        "sinopsis": "Taki y Mitsuha descubren un dia que al dormir sus cuerpos se intercambian, y comienzan a comunicarse por medio de notas. A medida que consiguen superar torpemente un reto tras otro, se va creando entre los dos un vinculo que poco a poco se convierte en algo mas romantico.",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "6",
        "titulo": "Quiero comerme tu pancreas",
        "poster": "imagenes/pancreas.jpg",
        "director": "Shin'ichirô Ushijima",
        "duracion": "108 min.",
        "precio": 2.99,
        "categoria": "Drama",
        "anio": 2018,
        "sinopsis": "Un dia, un solitario estudiante de secundaria encuentra un libro de bolsillo en el hospital. Su titulo es \"Conviviendo con la Muerte\". Resulta ser un diario de una chica de su clase, Sakura Yamauchi, en el cual escribe que, debido a su enfermedad pancreatica, le quedan solo unos cuantos meses de vida. Esto hace que surja una amistad entre ellos muy especial, desvelando la dificil circunstancia por la que atraviesa Sakura no solo en relacion a su enfermedad, sino tambien a otros factores que convierten su dia a dia en una cruel pesadilla. ",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "7",
        "titulo": "Una voz silenciosa",
        "poster": "imagenes/silent_voice.jpg",
        "director": "Naoko Yamada",
        "duracion": "130 min.",
        "precio": 4.99,
        "categoria": "Animacion",
        "anio": 2016,
        "sinopsis": "La historia gira en torno a Shoko Nishimiya, una estudiante de primaria que es sorda y que al cambiarse de colegio comienza a sentir el bullying de sus nuevos amigos. Uno de los principales responsables es Ishida Shoya quien termina por forzar que Nishimiya se cambie de escuela. Mucho tiempo despues, Ishida busca la redencion de sus malas acciones.",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "8",
        "titulo": "Mi vecino Totoro",
        "poster": "imagenes/totoro.jpg",
        "director": "Hayao Miyazaki",
        "duracion": "86 min.",
        "precio": 7.99,
        "categoria": "Animacion",
        "anio": 1988,
        "sinopsis": "En los 50, una familia japonesa se traslada al campo. Las dos hijas, Satsuki y Mei, entablan amistad con Totoro, un espiritu del bosque. El padre es un profesor universitario que estimula la imaginacion de sus hijas relatandoles fabulas e historias magicas sobre duendes, fantasmas y espiritus protectores de los hogares, mientras la madre se encuentra enferma en el hospital.",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "9",
        "titulo": "Toy Story 3",
        "poster": "imagenes/toy_story_3.jpg",
        "director": "Lee Unkrich",
        "duracion": "103 min.",
        "precio": 9.99,
        "categoria": "Animacion",
        "anio": 2010,
        "sinopsis": "Cuando Andy se prepara para ir a la universidad, el vaquero Woody, el astronauta Buzz y el resto de sus amigos juguetes comienzan a preocuparse por su incierto futuro. Efectivamente todos acaban en una guarderia, donde por ejemplo Barbie conocera al guapo Ken. Esta reunion de nuestros amigos con otros nuevos juguetes no sera sino el principio de una serie de trepidantes y divertidas aventuras. ",
        "ventas": 1,
        "valoracion": "0"
    },
    {
        "id": "10",
        "titulo": "One Piece Film Z",
        "poster": "imagenes/op.jpg",
        "director": "Tatsuya Nagamine",
        "duracion": "107 min.",
        "precio": 0.99,
        "categoria": "Animacion",
        "anio": 2012,
        "sinopsis": "Se dice que su poder es comparable al de las Armas Ancestrales, la \"carta de triunfo\" de la Marine, \"La Piedra Dyna\", fue robada. El responsable es el temido y terriblemente poderoso, ex-Almirante de la Marine, un hombre llamado \"Z\", quien se cruza en el camino de los Piratas del Sombrero de Paja. El Cuartel General de la Marine se mueve hacia adelante para hacer frente a esta conspiracion que incluso puede hacer temblar los pilares del mismo Nuevo Mundo. Por otra parte el ex-almirante Aokiji, persigue a los Sombreros de Paja por el Nuevo Mundo, mientras estos toman la postura de enfrentar a Z y su tripulacion con su increible poder. ",
        "ventas": 1,
        "valoracion": "0"
    }
]